package classwork.lesson170717;

public class Main {
    public static void main(String[] args) {
        System.out.println("asd");
    }
}

//статистика и котики; simple java || simple java 8; introduction in programming in java седжвика
//ооп в действии Бадда
//иерарзия классов для муз.инструментов, струнные щипковые духовые, ударные
//hw - косынка

/*
оказывается, косынка - solitaire
applet - "приложеньице" - изначально это небольшое приложение для браузера IE
мутатор - метод, меняющий состояние объекта
еще есть частый прием - передача объекту чего-либо в качестве параметра чтобы он как-то отобразил свое состояние на этом чем-то
при вызове метода на объекте класса в него всегда незримым параметром передается this - ссылка на данный объект

 */
