package classwork.consult;

public class Main {
    public static void main(String[] args) {
        System.out.println("asd");

    }
}

/*
для перегрузки надо чтоб вся сигнатура совпадала, кроме входных параметров
наследование vs композиция
композиция - использование объекта другого класса, ссылку на который он получает в конструкторе
алго, ооп, мультитрединг, java platform, java language, java sth
лямбд и стримов не будет скорее всего

хвостовая рекурсия - когда рекурсивный вызов идет в самой последней строке метода
в некоторых языках она заменяется компилятор на цикл, но не в java

рекурсия - когда ф-ция вызывает сама себя
когда метод вызывает сам себя 1 раз - легко заменяется циклом
если больше 1 раза - например в условном Фибоначчи - это делается сложнее

эта штука в динамическом программировании называется мемоизация
рекурсия в принципе применяется в сортировках, графах, алгоритме евклида, рекурсивной графике; все это есть у седжвика


 */
